src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ДополнительныеНаименования/ДополнительныеНаименования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНаименования</name>
  <comment>Наименования элементов структуры заказа и предметов снабжения на иностранном языке</comment>
  <resources>
    <name>Перевод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <comment>Предмет снабжения либо элемент структуры заказа с типом &quot;Группа&quot;</comment>
    <type>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.ХарактеристикиКораблей</types>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
      <types>CatalogRef.Флоты</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.Языки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РесурсыИСрокиСлужбыПредметовСнабжения/РесурсыИСрокиСлужбыПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РесурсыИСрокиСлужбыПредметовСнабжения</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ТипыПоказателейИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РегламентТОПредметовСнабжения/РегламентТОПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегламентТОПредметовСнабжения</name>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоемкостьРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоемкостьСопутствующихРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПериодичности</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПродолжительности</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗИПТребуемыеДляТОПредметовСнабжения/ЗИПТребуемыеДляТОПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗИПТребуемыеДляТОПредметовСнабжения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗИП</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПометкиПользователей/ПометкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПометкиПользователей</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Флаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВыгруженныеПредметыСнабжения/ВыгруженныеПредметыСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыгруженныеПредметыСнабжения</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВыгрузкиПредметовСнабжения</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КодыINCAT/КодыINCAT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КодыINCAT</name>
  <resources>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодINCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КаталогПредметовСнабжения/ObjectModule.bsl
////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьНомерОСК()
	Результат		= "ОСК-0000000001";
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	             	  |	КаталогПредметовСнабжения.НомерОСК КАК НомерОСК
	             	  |ИЗ
	             	  |	Справочник.КаталогПредметовСнабжения КАК КаталогПредметовСнабжения
	             	  |
	             	  |УПОРЯДОЧИТЬ ПО
	             	  |	НомерОСК УБЫВ";  	
	Выборка 		= Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() 
		И ЗначениеЗаполнено(Выборка.НомерОСК) Тогда		
		НомерСтрока 	= Формат(Число(Прав(Выборка.НомерОСК, 10)) + 1, "ЧГ=");		
		МассивНомера 	= Новый Массив;
		МассивНомера.Добавить("ОСК-");		
		ЧислоНулей 		= 10 - СтрДлина(НомерСтрока);		
		Для Сч = 1 По ЧислоНулей Цикл                 		
			МассивНомера.Добавить("0");			
		КонецЦикла;	// Для Сч = 1 По ЧислоНулей Цикл
		МассивНомера.Добавить(НомерСтрока);	
		Результат = СтрСоединить(МассивНомера);	  	
	КонецЕсли; // Если Выборка.Следующий() 	
	
	Возврат Результат;
КонецФункции // ПолучитьНомерОСК()

Процедура ДобавитьПоставщикаПоПользователю()
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Пользователь) Тогда
	
	Организация = Пользователь.Организация;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Организация) Тогда
	
	НайденныеСтроки = ИзготовителиИПоставщики.НайтиСтроки(Новый Структура("Контрагент", Организация));
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока 				= ИзготовителиИПоставщики.Добавить();
		НоваяСтрока.Контрагент 		= Организация;
		НоваяСтрока.Поставщик 		= Истина;
	Иначе
		НайденныеСтроки[0].Поставщик = Истина;
	КонецЕсли; // Если НайденныеСтроки.Количество() = 0 Тогда	
КонецПроцедуры // ДобавитьПоставщикаПоПользователю

////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; // Если ОбменДанными.Загрузка Тогда 	
	
	Если ЭтоНовый() 
		И РольДоступна("ПредставительПроектантаКорабля") Тогда
		ДобавитьПоставщикаПоПользователю();
	КонецЕсли; // Если ЭтоНовый() Тогда	
		
	ПровереноОСК = Справочники.СтатусыЗаписейСправочниковИКаталогов.ПровереноОСК;
	
	Если Не РольДоступна("ПолныеПрава") 
		И (РольДоступна("ПредставительПроектантаКорабля") 
			Или РольДоступна("ПредставительСтроителяКорабля")) 
		И ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "Статус") = ПровереноОСК Тогда	
		Отказ = Истина;
		Возврат;	
	КонецЕсли; // Если Не РольДоступна("ПолныеПрава") 
	
	Если Не ЗначениеЗаполнено(НомерОСК) 
		И Статус = ПровереноОСК Тогда		
		Блокировка 				= Новый БлокировкаДанных;
		ЭлементБлокировки 		= Блокировка.Добавить("Справочник.КаталогПредметовСнабжения");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();		
		НомерОСК 				= ПолучитьНомерОСК();	
	КонецЕсли; // Если Не ЗначениеЗаполнено(НомерОСК) 	
	
	РеквизитыПредметаСнабжения = ОбщиеФункцииСервер.ПолучитьЗначенияРеквизитов(Ссылка, "Наименование");	
	Если Не РеквизитыПредметаСнабжения = Неопределено 
		И Не РеквизитыПредметаСнабжения.Наименование = Наименование Тогда		
		ОбщиеФункцииПривилегированный.ДоавитьВОчередьОбновленияНаименованийКомплектующихИзделийИЗИП(ТекущаяДата(), Ссылка);		
	КонецЕсли; // Если Не РеквизитыПредметаСнабжения = Неопределено 
	
	Если Не Обозначение = ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "Обозначение") Тогда		
		ОбозначениеТранслитированное = ОбщиеФункцииКлиентСервер.ТранслитироватьОбозначениеРусВАнг(Обозначение);		
	КонецЕсли; // Если Не Обозначение = ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "Обозначение") Тогда			
	
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; // Если ОбменДанными.Загрузка Тогда
	
	Если ДополнительныеСвойства.Свойство("РесурсыИСрокиСлужбы") Тогда	
		РезультатЗаписиРесурсовИСроковСлужбы = ПредметыСнабженияСервер.ЗаписатьРесурсыИСрокиСлужбы(Ссылка, ДополнительныеСвойства.РесурсыИСрокиСлужбы); 		
		Если Не РезультатЗаписиРесурсовИСроковСлужбы.Выполнено Тогда		
			Отказ = Истина;
			Сообщить(РезультатЗаписиРесурсовИСроковСлужбы.Описание);
			Возврат;                                                		
		КонецЕсли; // Если Не РезультатЗаписиРесурсовИСроковСлужбы.Выполнено Тогда			
	КонецЕсли; // Если ДополнительныеСвойства.Свойство("РесурсыИСрокиСлужбы") Тогда	
	
	Если ДополнительныеСвойства.Свойство("РегламентТО") Тогда 	
		РезультатЗаписиРегламентаТО = ПредметыСнабженияСервер.ЗаписатьРегламентТО(Ссылка, ДополнительныеСвойства.РегламентТО); 		
		Если Не РезультатЗаписиРегламентаТО.Выполнено Тогда		
			Отказ = Истина;
			Сообщить(РезультатЗаписиРегламентаТО.Описание);
			Возврат;                                                            		
		КонецЕсли; // Если Не РезультатЗаписиРегламентаТО.Выполнено Тогда			
	КонецЕсли; // Если ДополнительныеСвойства.Свойство("РегламентТО") Тогда 	
	
	Если ДополнительныеСвойства.Свойство("ЗИПТребуемыеДляТО") Тогда 	
		РезультатЗаписиЗИПТребуемыхДляТО = ПредметыСнабженияСервер.ЗаписатьЗИПТребуемыеДляТО(Ссылка, ДополнительныеСвойства.ЗИПТребуемыеДляТО); 		
		Если Не РезультатЗаписиЗИПТребуемыхДляТО.Выполнено Тогда		
			Отказ = Истина;
			Сообщить(РезультатЗаписиЗИПТребуемыхДляТО.Описание);
			Возврат;		
		КонецЕсли; // Если Не РезультатЗаписиЗИПТребуемыхДляТО.Выполнено Тогда	
	КонецЕсли; // Если ДополнительныеСвойства.Свойство("ЗИПТребуемыеДляТО") Тогда 	
	
	Если ДополнительныеСвойства.Свойство("КодыINCAT") Тогда	
		РезультатЗаписиКодыINCAT = ПредметыСнабженияСервер.ЗаписатьКодыINCAT(Ссылка, ДополнительныеСвойства.КодыINCAT); 		
		Если НЕ РезультатЗаписиКодыINCAT.Выполнено Тогда		
			Отказ = Истина;
			Сообщить(РезультатЗаписиКодыINCAT.Описание);
			Возврат;		
		КонецЕсли; // Если НЕ РезультатЗаписиКодыINCAT.Выполнено Тогда			
	КонецЕсли; // Если ДополнительныеСвойства.Свойство("КодыINCAT") Тогда	
	
	Если СпецификацииПредметовСнабжения.ПолучитьСостояниеОтложен(Ссылка) Тогда	
		СпецификацииПредметовСнабжения.ДобавитьВРегистрАктуализацияСтруктурыПС(Ссылка, Ложь);	
	КонецЕсли; // Если СпецификацииПредметовСнабжения.ПолучитьСостояниеОтложен(Ссылка) Тогда	
	
	РегистрыСведений.ОчередьОбновленияИндекса.УстановитьОбъектВОчередьОбновленияПоисковогоИндекса(Ссылка);	
	
КонецПроцедуры // ПриЗаписи

Процедура ПередУдалением(Отказ)
	
	// Дополнительные наименования	
	НаборЗаписей = РегистрыСведений.ДополнительныеНаименования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Владелец.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда	
	
	// Ресурсы и сроки службы	
	НаборЗаписей = РегистрыСведений.РесурсыИСрокиСлужбыПредметовСнабжения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметСнабжения.Установить(Ссылка);
	НаборЗаписей.Прочитать();	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда	
	
	// Регламент ТО	
	НаборЗаписей = РегистрыСведений.РегламентТОПредметовСнабжения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметСнабжения.Установить(Ссылка);
	НаборЗаписей.Прочитать();	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда	
	
	// ЗИП, требуемые для ТО	
	НаборЗаписей = РегистрыСведений.ЗИПТребуемыеДляТОПредметовСнабжения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметСнабжения.Установить(Ссылка);
	НаборЗаписей.Прочитать();	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);      		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда
	
	// ПометкиПользователей
	НаборЗаписей = РегистрыСведений.ПометкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЭлементСтруктуры.Установить(Ссылка);
	НаборЗаписей.Прочитать();	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда	
	
	// ВыгруженныеПредметыСнабжения
	НаборЗаписей = РегистрыСведений.ВыгруженныеПредметыСнабжения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметСнабжения.Установить(Ссылка);
	НаборЗаписей.Прочитать();	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);      		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда
	
	// КодыINCAT
	НаборЗаписей = РегистрыСведений.КодыINCAT.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметСнабжения.Установить(Ссылка);
	НаборЗаписей.Прочитать();	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда
	
	// КодыINCATПредставление
	НаборЗаписей = РегистрыСведений.КодыINCATПредставление.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметСнабжения.Установить(Ссылка);
	НаборЗаписей.Прочитать();	
	Если НаборЗаписей.Количество() > 0 Тогда	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);		
	КонецЕсли; // Если НаборЗаписей.Количество() > 0 Тогда	
	
КонецПроцедуры // ПередУдалением

Процедура ПриКопировании(ОбъектКопирования)	
	НомерОСК 	= "";
	Статус 		= Справочники.СтатусыЗаписейСправочниковИКаталогов.ПустаяСсылка();	
КонецПроцедуры // ПриКопировании
